[{"course_info": "About this course: Whether you are accessing a bank website, Netflix or your home router, chances are that your computer is interacting with a Linux system.  The world runs on Linux.  In this course, we will dive into how Linux works from an enterprise perspective.  \nIn week 1 we will look at what Linux is used for in the enterprise.  By the end of week 1, you will be able to differentiate between different versions of Linux and understand how they are used in an enterprise environment.  In week 2, we will explore how Linux systems are configured.  By the end of week 2, you will be able to demonstrate different Linux commands and how they are used.  You will also be able to interact with a Linux system.  In week 3, we will explore Linux authentication mechanisms and how to add users and user controls to a Linux system.  By the end of week 3, you should be able to demonstrate how to appropriately add users to a Linux machine and secure them.  In week 4, we will explore how to harden a Linux system.  By the end of week 4, you should be able to classify different technologies to secure Linux and differentiate access control methods for Linux applications.", "target_audience": "Who is this class for: This course is for those who want to understand how Linux is used in an enterprise environment.  It is for those who plan on becoming a Linux system administrator and need to brush up on their skills.  This course is also for those who need to apply and assess system security and how it is used an a Linux environment.", "week_data": [{"video": ["Introduction", "About this course", "Resources for building your own test environment", "About the Instructor", "Linux in the Enterprise", "About Linux and Distributions", "Best of Linux Distributions - 2017", "Common Commands and Utilities", "Linux from Scratch", "Package Management", "Lecture Slides", "Linux anyone?", "Practice Quiz - Week 1", "About Linux"], "description": "Welcome to the first module!  This module will cover key aspects of the course in addition to discussing Linux in the enterprise and distributions.", "title": "Introduction to Practical Linux System Management"}, {"video": ["Enterprise Install of CentOS", "How to install Linux", "Networking in Linux", "Networking within Linux", "SUDO", "SSH", "SSH - HowTo", "CRON", "Cron - HowTo", "Lecture Slides", "What commands do you want to know more about?", "Practice Quiz - Week 2", "Configuring Linux"], "description": "This module covers the installation and configuration of Linux in an enterprise setting.", "title": "Configuring Linux in the Enterprise"}, {"video": ["Adding Users", "Adding and Modifying Users", "Securing Users", "Privilege Escalation", "Access Control", "Working with other systems", "Authentication - PAM", "Using PAM", "Lecture Slides", "Permissions", "Practice Quiz - Week 3", "Users, authentication, and authorization"], "description": "This module describes the essentials of managing users in the enterprise.  ", "title": "Users, authentication, and authorization in a Linux environment"}, {"video": ["SELinux", "SELinux - Introduction and commands", "Linux Security", "Software firewalls in Linux", "Services within Linux", "UFW Cheat Sheet and common commands", "Firewalld - HowTo", "Lecture Slides", "Securing Linux", "Practice Quiz - Week 4", "Linux Security"], "description": "This module covers Linux security.  What does a system administrator need to know in order to adequately protect their systems.", "title": "Securing Linux in the Enterprise"}, {"video": ["A new hire - you!"], "description": "This is the course project.  Linux threats come from a variety of sources.  It's up to you to have a stance on how to administer and protect a system.", "title": "Practical Linux Administration - Project"}], "package_num": "3", "level": "Intermediate", "created_by": "University of Colorado System", "rating": "4.0", "title": "Linux Server Management and Security", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Computer Security and Systems Management Specialization "}, {"course_info": "About this course: The world runs computers.  From small to large businesses, from the CEO down to level 1 support staff, everyone uses computers.  This course is designed to give you a practical perspective on computer security.  This course approaches computer security in a way that anyone can understand.  Ever wonder how your bank website is secure when you connect to it?  Wonder how other business owners secure their network?  Wonder how large data breaches happen?  This is practical computer security.  It will help you answer the question – what should I focus on?", "target_audience": "Who is this class for: This course is for anyone who is interested in learning about computer security - this includes anyone who might be a business owner, a website developer, a help desk technician, an accountant, really anyone!  You will learn how computer security impacts everyone and how to start to go about looking at computer security, not as a large, daunting process, but as something that can be approached logically and thoughtfully.  At the end of the course, you should be able to understand what kinds of topics you should be discussing with your employees, your family, or your co-workers about security in a practical manner.", "week_data": [{"video": ["Welcome!", "About the Instructor", "Glossary of Computer Security Terms", "Introduction to Practical Computer Security", "Computer Security Key Definitions", "The Computer Security Environment Today", "Security Frameworks", "Security Frameworks", "Lecture Slides", "What do you think is one of the biggest problems with security today?", "Practice Quiz - Week 1", "Week 1: Practical Computer Security"], "description": "Understand the basics of computer security for business", "title": "What is Practical Computer Security"}, {"video": ["Confidentiality", "Integrity", "Availability", "Where will I use this? Practical application of principles", "Home Depot data breach", "Lecture Slides", "Which one?", "Practice Quiz - Week 2", "Week 2 - CIA Triad"], "description": "Confidentiality, Integrity and Availability are the cornerstones of security.  Do you know how they apply?", "title": "The CIA Triad"}, {"video": ["What is Risk", "Risk Assessment", "Risk Frameworks", "Risk Framework - Required Reading", "Lecture Slides", "How do you assess risk?", "Practice Quiz - Week 3", "Week 3 - How Do We Protect Information?"], "description": "Risk in business is inevitable.  You will explore what risk means and how to assess it", "title": "How we assess risk daily"}, {"video": ["Public Key Infrastructure", "Benefits of PKI", "Ports and Protocols", "Message Authentication", "Practical Application of Hashing", "Cryptography", "Digital Encryption Applied - Cryptocurrency - Optional", "Encryption", "Practice Quiz - Week 4", "Week 4 - Daily Security"], "description": "Often times we may not know how to assess our security daily.  We may think we are secure when we may not be.  This module covers some of the tools, ports, and protocols used in everyday computing to remain secure.", "title": "Practical Application of Daily Security"}, {"video": ["Attack Surfaces", "Attack Surfaces"], "description": "This is the course project.  You will assess attack surfaces and risk based off of the attack surfaces.  This will sum up what you have worked on throughout the course.", "title": "Attack Surfaces"}], "package_num": "1", "level": "Beginner", "created_by": "University of Colorado System", "rating": "4.7", "title": "Introduction to Cybersecurity for Business", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Cybersecurity for Business Specialization "}, {"course_info": "About this course: The world runs on computers.  Your watch, your TV, your car.  You might be familiar on how to operate each of these.  Your home computer you are even more familiar with operating it.  But what does it take to really take computer systems to the next level?  - The enterprise level.  In this course we discuss what makes home computing systems different from enterprise computing systems. This course will also help you prepare and design your own home lab to explore enterprise operating systems.\n\nThis course is for anyone who is exploring what it might take to have a job as a system administrator or for those who are already specialized in one area of system management and would like to move to another.  This course may also be for those who are looking to understand how computer security plays an important role in system management. \n\nAt the end of the course, you will also be able to illustrate how different enterprise technologies play role in computing at an enterprise level.  You will also be able to discuss the three pillars of the CIA triad and how they apply to enterprise systems.  \nWhile there is no technical and software component installs necessary for the completion of this course, supplemental how-to guides will be provided if you wish to follow along on the technical portion presented during the course.", "target_audience": null, "week_data": [{"video": ["Welcome!", "About this course", "Resources for building your own test environment", "Why are you interested in this course?", "Introduction", "About the Instructor", "Don't I just trust what Apple, Microsoft, and the other guys tell me?", "What is Personal Computing?", "What is Enterprise Computing?", "What Roles are there in System Management?", "What is Going to Prepare Me for Practical System Management?", "Lecture Slides", "Personal and Enterprise Computing"], "description": "Welcome and Introduction to Enterprise System Management and Security", "title": "It's not that different from my home computer is it? Why home computing doesn't map to enterprise computing"}, {"video": ["Why Do We Need to Learn Networking?", "Addressing", "Subnetting", "Network Addressing and Subnetting Explained from Cisco", "OSI Model", "OSI Model Breakdown links", "Lecture Slides", "Addressing and Sub-netting Practice", "Everyday networking", "Networking"], "description": "This module discusses network and why we need to learn network as part of system management overall.", "title": "Doesn't everything work on wireless?  An introduction to enterprise networking"}, {"video": ["What is Virtualization?", "Types of Virtualization", "When to use and not use virtualization", "Your Computer vs. an Enterprise System", "Lecture Slides", "Virtual Everything!", "Overview of Virtualization from VMware", "Virtualization"], "description": "This module covers the fundamentals of virtualization and how we use virtualization in the enterprise to perform work.", "title": "What is virtualization"}, {"video": ["Why information security in the first place?", "FIPS 199", "What is a secure computer?", "Risk in System Management", "Confidentiality, Integrity and Availability", "TED Talk", "Lecture Slides", "This week in security news...", "Confidentiality and data breaches", "Information Security"], "description": "", "title": "Isn't my computer already protected?  Good system management starts with knowing security"}, {"video": ["Suggested BYOD articles", "An assessment of Bring Your Own Device (BYOD)"], "description": "This is the project for the course.  ", "title": "Course Project - BYOD"}], "package_num": "1", "level": "Beginner", "created_by": "University of Colorado System", "rating": "4.7", "title": "Enterprise System Management and Security ", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Computer Security and Systems Management Specialization "}, {"course_info": "About this course: Data breaches occur nearly every day.  From very large retailers, down to your fantasy football website, and anywhere in between, they have been compromised in some way.  How did the attackers get in?  What did they do with the data they compromised?  What should I be concerned with in my own business or my systems?  This course is the second course in the Practical Computer Security.  It will discuss types of threats and attack vectors commonly seen in today’s environment.  I hate to be the bearer of bad news, but threats are all over the place!  This course isn’t designed to insight fear that there is no hope for keeping systems and business secure, but rather educate you on how attacks are carried out so that you have a better sense of what to look out for in your business or with your systems.", "target_audience": "Who is this class for: This course is for everyone who wants to understand how computer attacks are carried out and what to watch out for if you have information that you need to protect.  This course is for those individuals that are looking to be able to discuss computer security with their colleagues and superiors and offer suggestions on what to look out for.  The project at the end of the course will also allow you to investigate data breaches and be able to determine where attacks came from and how they were carried out.  This course will help you identify and classify attack vectors and how to protect yourself, your business, and your systems from attacks.", "week_data": [{"video": ["Introduction", "About this course", "About the Instructor", "Digital Identity - Required Reading", "Phishing", "Social Engineering", "Authentication based attacks", "Lecture Slides", "What do you want out of this course?", "Practice Quiz - Week 1", "Week 1 - User based attacks"], "description": "Welcome! This week we'll explore users and user based attacks.  User based attacks are common because it may be easier to compromise a human rather than a computer.", "title": "THREATS AND ATTACK VECTORS IN COMPUTER SECURITY"}, {"video": ["Viruses and Worms", "Network based attacks", "Denial of Service attacks", "DDoS Attacks", "Wireless based attacks", "Mobile Based Attacks", "Lecture Slides", "Attacks", "Practice Quiz - Week 2", "Week 2 - Network and system based attacks"], "description": "Threats against networks and systems are the most common type of attack method.  This week will explore these concepts.", "title": "Network and system based attacks"}, {"video": ["What is \"The Cloud\"?", "Why do we need to be concerned with “The Cloud”", "SaaS", "Database Security", "Real Cloud Based Attacks", "Cloud Security Alliance", "Lecture Slides", "The Cloud", "Practice Quiz - Week 3", "Week 3: Cloud Security"], "description": "You use the cloud every day; you may not even realize it!  This week will focus on the cloud and security surrounding cloud and cloud services.", "title": "Cloud Security"}, {"video": ["Misconfiguration", "Operating Systems", "Software: Buffer Overflows", "Software: Web Based Applications", "Software: Injection", "Shadow Brokers", "Lecture Slides", "Vulnerabilities", "Practice Quiz - Week 4", "Week 4: Common Vulnerabilities"], "description": "The week will focus on common vulnerabilities that systems face and how they work.", "title": "Common Vulnerabilities"}, {"video": ["Discovering Data Breaches!", "How data breaches are found out"], "description": "Data breaches occur daily.  Sometimes they are announced right away, other times they are found out months after the compromise.  This week will focus on the course project.", "title": "Data Breaches"}], "package_num": "2", "level": "Beginner", "created_by": "University of Colorado System", "rating": "4.6", "title": "Cyber Threats and Attack Vectors", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Cybersecurity for Business Specialization "}, {"course_info": "About this course: Microsoft Windows has been at the forefront of enterprise computing for several decades.  What most office workers see is the desktop side – such as Windows 7, 8 or 10.  This course explores what it takes to design and build the server side of Windows in an enterprise environment.  This course will explore everything from Windows Server installation to configuring users, to hardening the server operating system itself.  \nThis course is the second course in the System Management and Security Specialization focusing on enterprise system management.  The first week of this course provides an overview of how Windows operates in an enterprise environment and what it may look like in the real world.  Week 2 of the course will show you how Windows users interact with the system.  At the end of Week 2, you will be able to demonstrate how Windows authentication works at the end of Week 2.  Week 3 will explore authorization in a Windows environment.  At the end of Week 3, you will be able to differentiate between different authorization mechanisms and use different technologies to secure data within the environment.  Week 4 explores built in security features of Windows and demonstrates how to use each technology effectively and in what circumstances you would use what technology for what purpose. At the end of week 4, you will be able to determine which technology is the best technology to use to secure certain portions of the Windows operating system.", "target_audience": "Who is this class for: This course is for anyone who is interested in becoming a Windows system administrator and understand what it takes to operate Windows systems on an enterprise level.  At the end of the course you will be able to use your knowledge and skills to assess how Windows fits into an enterprise environment and how best to use certain technologies to accomplish specific goals within a Windows environment.", "week_data": [{"video": ["Welcome!", "About This Course", "Resources for building your own test environment", "About the Instructor", "Windows 2016 Homepage from Microsoft", "Windows in the enterprise", "Windows Server install", "Windows Server - Getting Started", "Networking in Windows", "Windows anyone?", "Lecture Slides", "Introduction to Windows"], "description": "In this module we'll discuss how Windows is used in an enterprise setting.", "title": "Introduction to practical Windows system management"}, {"video": ["Windows Logon process", "Kerberos", "Kerberos Explained", "Active Directory", "Group Policy", "How have you authenticated today?", "Users and Authentication"], "description": "In this module we'll discuss how users are created, grouped and managed in an enterprise environment.", "title": "Users and authentication in a Windows environment"}, {"video": ["What is authorization?", "Rights and Permissions", "Access Control", "Managing users on an enterprise level", "Windows Authorization Manager Model", "What is RBAC?", "Lecture Slides", "Users and authorization"], "description": "This module looks at users and authorization.  Access control is discussed in conjunction with rights and privileges.", "title": "Users and authorization in a Windows environment"}, {"video": ["Built in security controls", "Windows Server 2016 Security Resources", "Restricting access to software and resources", "AppLocker Explanation", "Security considerations for Windows systems", "Windows and Encryption", "Lecture Slides", "Windows Security"], "description": "Security within Windows is generally pretty good, however, windows needs to be configured in order to increase overall system security.", "title": "Securing Windows in the enterprise"}, {"video": ["Kerberos Explained- the MIT play", "Explaining Kerberos"], "description": "", "title": "Course Project - Kerberos"}], "package_num": "2", "level": "Beginner", "created_by": "University of Colorado System", "rating": null, "title": "Windows Server Management and Security", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Computer Security and Systems Management Specialization "}, {"course_info": "About this course: Computer attacks and data breaches are inevitable.  It seems like every day a data breach occurs and the victims of the data breach suffer.  Their information is stolen or posted online.  The company’s or businesses who had the breach go on, learn a little from the attack, and just give credit monitoring out as if nothing happened.  What if you could help prevent a data breach in your organization?  This is the third course in the Practical Computer Security specialization.  This course looks at detection and mitigation of threats and attack vectors and discusses how to use tools and principles to protect information.  By the end of the course you should be able to make suggestions on what type of detection and mitigation strategy is right for your systems or business given the known threats and attack vectors.  You should be able to discuss what features you want in a firewall, or how cash registers or sensitive data systems should be secured.  The project at the end of the course will allow you to apply what you have learned to argue what type of detection and mitigation strategies should have been employed by companies and businesses that have suffered a data breach.", "target_audience": "Who is this class for: This course is for anyone who has data they need to protect.  You could be a CEO of a company that wants to understand how your employees are protecting your data.  You could be a systems administrator that is stuck wondering which threat detection method is best for your systems.  You could be a tier 1 help desk technician looking to understand how mitigation strategies work to move up to tier 2 or tier 3 support.  This course will help you at any skill level understand how to better protect your data and systems from a practical, business perspective.", "week_data": [{"video": ["Introduction", "About this course", "About the Instructor", "Firewall basics", "Advanced firewalls", "Types of firewall configurations", "Lecture Slides", "Stop blaming the firewall!", "Practice Quiz - Week 1", "Week 1 - Firewalls - the gatekeeper"], "description": "Welcome!  This week we'll explore firewalls as they are usually the first line of defense against a threat or attack.", "title": "Introduction and Firewalls"}, {"video": ["Detection Methods", "Intrusion Detection Systems", "Intrusion Detection Readings", "Intrusion Prevention Systems", "Honeypots", "Lecture Slides", "Intrusion Detection and Prevention", "Practice Quiz - Week 2", "Week 2 - Intrusion Detection and Prevention"], "description": "This module will cover intrusion detection and prevention, which is one of the most essential concepts in looking at how threats and attacks are detected and mitigated.", "title": "Intrusion Detection and Prevention"}, {"video": ["Anti-Virus/Anti-Malware", "Snort", "HIDs and HIPs", "Splunk", "Splunk and Security", "Understanding IPS vs. IDS", "Lecture Slides", "What do you use?", "Practice Quiz - Week 3", "Week 3 - Detection and Prevention Tools"], "description": "This module covers intrusion detection and prevention tools used for both networks and systems.  There will be demos of the tools so that you can understand how they might protect your network or systems better.", "title": "Detection and Prevention tools"}, {"video": ["Attacks are inevitable - Prepare", "Before the Attack", "The Incident Handlers Handbook", "During the Attack", "After the Attack", "Case Study - The Target Breach", "What do you think?", "Practice Quiz - Week 4", "Week 4 - Real World Attacks"], "description": "This module will focus on attacks and how detection and response makes the world of difference when responding to an attack.", "title": "Attacks are Inevitable - Case Study"}, {"video": ["How data breaches are exposed", "Understanding that data breaches happen every day"], "description": "This module is the course project.  You will review data breaches and understand how they were detected and mitigated.", "title": "Understanding detection and mitigation"}], "package_num": "3", "level": "Beginner", "created_by": "University of Colorado System", "rating": "4.9", "title": "Detecting and Mitigating Cyber Threats and Attacks", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Cybersecurity for Business Specialization "}, {"course_info": "About this course: I’ve heard this before – “I’m not sure my computer security practices are working”.  I reply “Have you tested them?”  This course is the fourth and final course in the Practical Computer Security specialization.  In this course, you’ll learn how to proactively test what you have put in place to protect your data.  In the first week you’ll be able to discuss the basics of deterrents and how to “trick” attackers into believing they’ve hit a goldmine of data away from your real systems.  In week 2, you’ll be able to understand and discuss the steps of penetration testing methodology.  In week 3, you will be able to understand and apply what you have learned on your own systems to test whether your systems are secure or not.  In week 4, we’ll discuss planning for your own methodology that you can apply to your own systems.  And finally in week 5, we’ll finish up with a project that will allow you to test your skills in a safe environment.", "target_audience": "Who is this class for: This course is for anyone who is interested in testing their own systems to help verify computer security controls are in place for their own systems.  It is for those who want to know what is allowed and not allowed, and who to consult if you have questions.  It is for system administrators that want to verify system security.  ", "week_data": [{"video": ["Introduction", "About this course", "About the Instructor", "Information sharing", "Threat Intelligence", "Resources for building your own testing environment", "Lecture Slides", "Information Sharing", "Practice Quiz - Week 1", "Week 1: Information Sharing"], "description": "This module covers information sharing.  Information sharing is an important tool to help organizations gather information from others so they can protect themselves.", "title": "Information Sharing and Threat Intelligence"}, {"video": ["\"Warning - only try this at home, or with written permission\"", "Penetration Testing", "Intelligence Gathering", "Vulnerability Scanning", "Exploitation", "Resources to help you further your skills", "Lecture Slides", "Methodology", "Practice Quiz - Week 2", "Week 2 - Methodology"], "description": "This module will cover the pen testing methodology.  Not following a pen testing methodology may lead to false positives or worse, false negatives in a testing scenario.", "title": "Penetration Testing - Methodology"}, {"video": ["Creating your own lab", "Nmap", "Nessus", "Metasploit", "Pen Testing Distributions", "Which tools?", "Practice Quiz - Week 3", "Week 3 - Penetration Testing Tools"], "description": "This module will cover some of the tools used in the penetration testing methodology.  These are just common tools used to gain information, find exploits and compromise systems.  There are many more tools out there, but these are the most commonly used.", "title": "Common Pen Testing Tools"}, {"video": ["Record keeping", "Legal issues", "Where to turn if you have an incident", "Where do i go from here?", "University of Colorado Security Program - Required", "Lecture Slides", "GDPR - Privacy", "Legal issues?", "Practice Quiz - Week 4", "Week 4 - Effective computer security management"], "description": "This module will cover some of the other issues and concerns for those interested in proactive security.  Legal issues are important for any level of management and administration to be concerned with.  Planning goes a long way toward effective proactive computer security.", "title": "Proactive computer security management"}, {"video": ["Mutillidae", "Usage Instructions", "Mutillidae Whitepaper", "Mutillidae"], "description": "This is the course project.  The goal is for you to compromise or gain data from a test system.", "title": "Exploiting OWASP Top 20 Controls"}], "package_num": "4", "level": "Beginner", "created_by": "University of Colorado System", "rating": "5.0", "title": "Proactive Computer Security", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Cybersecurity for Business Specialization "}, {"course_info": "About this course: Good system management not only requires managing the systems themselves, but requires careful planning to make systems interact with each other, auditing of the systems once the systems are built, and proactive maintenance of all systems.  Organizations also rely on organizational policies, such as Acceptable Use Policies to bolster the technical aspect of system management.  \nThis course explores many of the behind the scenes requirements of good system management.  The first half of the course covers how to build security into system management process and the organization policies necessary for any enterprise to follow.  The latter half of the course focuses on auditing and maintenance of systems once they have been designed, and implemented.  \nBy the end of the course you should be able to design and construct organizational policies based on a set of requirements, audit a system based on those requirements, and make sure systems adhere technically to the set of requirements.", "target_audience": "Who is this class for: This course is for those who want to understand and implement strong policies that are not necessarily technical in nature.  This course will help those looking to design a disaster recovery plan or system assessment meet their criteria for auditing purposes.", "week_data": [{"video": ["Introduction", "About this course", "Resources for building your own test environment", "About the Instructor", "Security at the forefront", "Attack surfaces", "Integrity", "Attack surface analysis", " What is it that you want to get out of this course?", "Lecture Slides", "Practice Quiz - Week 1", "Critical First Steps"], "description": "This module covers the essentials of what you need to look at first in system management", "title": "Critical first steps in System Management"}, {"video": ["Policies - Part 1: Organizational Policies", "Organizational Policies", "Policies - Part 2: Technical Policies", "Technical Policies", "Separation of Duties", "Planning for Disaster", "If you build it - they will get around it", "What about policies?", "Lecture Slides", "Practice Quiz - Week 2", "Planning"], "description": "How do enterprises deploy systems?  They plan!", "title": "Planning for an enterprise system environment"}, {"video": ["Strategies for Monitoring", "Splunk", "Splunk Resources", "Auditing", "Operational Intelligence", "Splunk - Working Smarter NIST", "Syslog", "Auditing your own systems", "Lecture Slides", "Practice Quiz - Week 3", "Auditing"], "description": "Once a system is planned and built, it's now time to continuously monitor and audit the systems.", "title": "Auditing systems in the enterprise"}, {"video": ["Updating systems in the enterprise", "When something goes wrong", "Baselining and Assessment", "Backup Strategies", "The 3-2-1 Backup Strategy", "What do you use to backup your data?", "Lecture Slides", "Practice Quiz - Week 4", "Maintenance"], "description": "Systems need on-going maintenance.  Understanding what to maintain is key in providing a well running service or system.", "title": "Maintaining systems in the enterprise"}, {"video": ["Congratulations!", "Understanding and writing organizational policies"], "description": "This is the course project.  Organizational policies are a necessity for an enterprise or organization.  This module allow you to develop what you have learned.", "title": "Organizational Policies - Project"}], "package_num": "4", "level": "Intermediate", "created_by": "University of Colorado System", "rating": null, "title": "Planning, Auditing and Maintaining Enterprise Systems", "teach_by": [{"name": "Greg Williams", "department": "Department of Computer Science"}], "package_name": "Computer Security and Systems Management Specialization "}]